bekencorp/bk_idk/middleware/soc/bk7258_cp1/hal/sys_hal.c
// Copyright 2020-2021 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <common/bk_include.h>
#include "sys_hal.h"
#include "sys_ll.h"
#include "aon_pmu_hal.h"
#include "gpio_hal.h"
#include "gpio_driver_base.h"
#include "sys_types.h"
#include <driver/aon_rtc.h>
#include <driver/hal/hal_spi_types.h>
#include <driver/hal/hal_qspi_types.h>
#include "gpio_hal.h"
#include "timer_hal.h"

#define PM_CLKSEL_CORE_320M        (2)
#define PM_CLKSEL_CORE_480M        (3)
#define PM_CLKDIV_CORE_0           (0)
#define PM_CLKDIV_CORE_1           (1)
#define PM_VDDDIG_H_VOL_0v9        (0xC)
#define PM_CLKDV_CPU1_1            (0x1)
static sys_hal_t s_sys_hal;
uint32 sys_hal_get_int_group2_status(void);
bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value);
uint32_t sys_hal_vdddig_h_vol_get();

/**  Platform Start **/
/** Platform Misc Start **/
bk_err_t sys_hal_init()
{
	s_sys_hal.hw = (sys_hw_t *)SYS_LL_REG_BASE;
	return BK_OK;
}
/** Platform Misc End **/

void sys_hal_usb_enable_clk(bool en)
{
	sys_ll_set_cpu_device_clk_enable_usb_cken(en);
}

void sys_hal_usb_analog_phy_en(bool en)
{
	extern void delay(INT32 num);

	if(en) {
		sys_ll_set_ana_reg10_en_usbvcc1v8(en);
		delay(320);
		sys_ll_set_ana_reg10_en_usbvcc3v(en);
	}
	else {
		sys_ll_set_ana_reg10_en_usbvcc3v(en);
		delay(320);
		sys_ll_set_ana_reg10_en_usbvcc1v8(en);
	}
}

/** Platform PWM Start **/

/** Platform PWM End **/

void sys_hal_flash_set_dco(void)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_flash(FLASH_CLK_DPLL);
}

void sys_hal_flash_set_dpll(void)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_flash(FLASH_CLK_APLL);
}

void sys_hal_flash_set_clk(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_flash(value);
}

void sys_hal_flash_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(value);
}

/* REG_0x09:cpu_clk_div_mode2->cksel_flash:0:XTAL  1:APLL  1x :clk_120M,R/W,0x9[25:24]*/
uint32_t sys_hal_flash_get_clk_sel(void)
{
	return sys_ll_get_cpu_clk_div_mode2_cksel_flash();
}

/* REG_0x09:cpu_clk_div_mode2->ckdiv_flash:0:/1  1:/2  2:/4  3:/8,R/W,0x9[27:26]*/
uint32_t sys_hal_flash_get_clk_div(void)
{
	return sys_ll_get_cpu_clk_div_mode2_ckdiv_flash();
}

/** Flash end **/

/*for low power function start*/
void sys_hal_module_power_ctrl(power_module_name_t module,power_module_state_t power_state)
{
	uint32_t value = 0;

	if((module >= POWER_MODULE_NAME_MEM1) && (module <= POWER_MODULE_NAME_ROM_PGEN)) {
		value = 0;
		value = sys_ll_get_cpu_power_sleep_wakeup_value();
		if(power_state == POWER_MODULE_STATE_ON) {
			value &= ~(1 << module);
        	} else {
			value |= (1 << module);
		}
		sys_ll_set_cpu_power_sleep_wakeup_value(value);
	} else if(module == POWER_MODULE_NAME_CPU1) {

		if(power_state == POWER_MODULE_STATE_ON) {
			//power on and then support clock
			sys_ll_set_cpu1_int_halt_clk_op_cpu1_pwr_dw(POWER_MODULE_STATE_ON);
			sys_ll_set_cpu1_int_halt_clk_op_cpu1_halt(0);

			//wait halt really cleared,clock support finish
			for(int i = 0; i < 1000; i++);
		} else {
			//un-support clock and then power down
			sys_ll_set_cpu1_int_halt_clk_op_cpu1_halt(1);
			//here should wait halt really finish and then power down
			for(int i = 0; i < 1000; i++);

			sys_ll_set_cpu1_int_halt_clk_op_cpu1_pwr_dw(POWER_MODULE_STATE_OFF);
		}
	} else if(module == POWER_MODULE_NAME_TCM1_PGEN) {
		if(power_state == POWER_MODULE_STATE_ON) {		
			/*TODO
			  sys_ll_set_cpu_power_sleep_wakeup_tcm1_pgen(0);*/
			while(1){;}
		} else {
			/*TODO
			sys_ll_set_cpu_power_sleep_wakeup_tcm1_pgen(1);*/
			while(1){;}
		}
	} else {
		;//do something
	}
}

int32 sys_hal_module_power_state_get(power_module_name_t module)
{
	uint32_t value = 0;

	if((module >= POWER_MODULE_NAME_MEM1) && (module <= POWER_MODULE_NAME_ROM_PGEN)) {
		value = sys_ll_get_cpu_power_sleep_wakeup_value();
		value = ((value >> module) & 0x1);
		return value;
	} else if(module == POWER_MODULE_NAME_CPU1) {
		return sys_ll_get_cpu_current_run_status_cpu1_pwr_dw_state();
	} else if (module == POWER_MODULE_NAME_TCM1_PGEN) {
		/*TODO
		return sys_ll_get_cpu_power_sleep_wakeup_tcm1_pgen();*/
		while(1){;}
		return 0;
	}

	return 0;
}

int sys_hal_rosc_calibration(uint32_t rosc_cali_mode, uint32_t cali_interval)
{
	if (rosc_cali_mode == 0) { //Auto
		sys_ll_set_ana_reg6_spi_trig(1);
		sys_ll_set_ana_reg6_calib_interval(cali_interval);
		sys_ll_set_ana_reg6_modifi_auto(0);
		sys_ll_set_ana_reg6_modify_interval(0x20);
		sys_ll_set_ana_reg6_xtal_wakeup_time(8);
		sys_ll_set_ana_reg6_cal_mode(1); //1: 32K, 0: 31.25K
		sys_ll_set_ana_reg6_calib_auto(1);
	} else if (rosc_cali_mode == 1) { //Manual
		sys_ll_set_ana_reg6_manu_ena(0);
		sys_ll_set_ana_reg6_spi_trig(0);
		sys_ll_set_ana_reg6_spi_trig(1);
	} else if (rosc_cali_mode == 2) { //Disable
	} else {
	}

	return BK_OK;
}

int sys_hal_rosc_test_mode(bool enabled)
{
	if (enabled) {
		sys_ll_set_ana_reg4_ck_tst_enbale(1);
		sys_ll_set_ana_reg4_cktst_sel(0);
		sys_ll_set_ana_reg5_rosc_tsten(1);
		sys_ll_set_ana_reg6_cal_mode(1);
		//sys_ll_set_ana_reg6_calib_auto(0);
		//sys_ll_set_ana_reg6_calib_auto(1);
		REG_WRITE((SOC_AON_GPIO_REG_BASE + (24 << 2)), 0x40);
	} else {
		sys_ll_set_ana_reg4_ck_tst_enbale(0);
		sys_ll_set_ana_reg4_cktst_sel(0);
		sys_ll_set_ana_reg5_rosc_tsten(0);
		sys_ll_set_ana_reg6_cal_mode(0);
		sys_ll_set_ana_reg6_calib_auto(0);
	}
	return BK_OK;
}

void sys_hal_module_RF_power_ctrl (module_name_t module,power_module_state_t power_state)
{
    uint32_t value = 0;
	value = sys_ll_get_ana_reg6_value();
    if(power_state == POWER_MODULE_STATE_ON)//power on
    {
		//value |= ((1 << SYS_ANA_REG6_EN_SYSLDO_POS)|(1 << SYS_ANA_REG6_EN_DPLL_POS)|(1 << SYS_ANA_REG6_EN_TEMPDET_POS));//en_sysldo,en_dpll
		//value &= ~(1 << SYS_ANA_REG6_XTAL_LPMODE_CTRL_POS);//when using the xtal as the 32k,it need close the xtal low power mode
		//value |= (1 << 11);//en_audpll //temp close,we will open when be neeeded
		//value |= (1 << 8);//en_dco     //now no module using,temp close,we will open when be neeeded
		//value |= (1 << 7);//en_xtall   //now no module using,temp close,we will open when be neeeded
    }
	else //power down
	{
		value &= ~(1 << 12);//en_dpll
		value &= ~(1 << 11);//en_audpll
		value &= ~(1 << 8);//en_dco
		value &= ~(1 << 7);//en_xtall
	}

	sys_ll_set_ana_reg6_value(value);

