bekencorp/bk_idk/middleware/soc/bk7258_cp1/hal/sys_hal.c
}

void sys_hal_cpu0_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu0_int_halt_clk_op_cpu0_int_mask( clock_state);
}
void sys_hal_cpu1_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_int_mask( clock_state);
}

void sys_hal_set_cpu1_boot_address_offset(uint32_t address_offset)
{
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_offset(address_offset);
}

void sys_hal_set_cpu2_boot_address_offset(uint32_t address_offset)
{
    sys_ll_set_cpu2_int_halt_clk_op_cpu2_offset(address_offset);
}

void sys_hal_set_cpu1_reset(uint32_t reset_value)
{
    /*1:reset ; 0:not reset*/
    sys_ll_set_cpu1_int_halt_clk_op_cpu1_sw_rst(reset_value);
}

void sys_hal_set_cpu2_reset(uint32_t reset_value)
{
    /*1:reset ; 0:not reset*/
    sys_ll_set_cpu2_int_halt_clk_op_cpu2_sw_rst(reset_value);
}

void sys_hal_all_modules_clk_div_set(clk_div_reg_e reg, uint32_t value)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

    uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	REG_WRITE(clk_div_reg_address, value);
}

uint32_t sys_hal_all_modules_clk_div_get(clk_div_reg_e reg)
{
    clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
    clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

	 uint32_t clk_div_reg_address = clk_div_addr->reg_address;

	return REG_READ(clk_div_reg_address);
}

void sys_hal_cpu_clk_div_set(uint32_t core_index, uint32_t value)
{
	if(core_index == 0)
	{
	}
	else
	{
		sys_ll_set_cpu1_int_halt_clk_op_cpu1_speed(value);
	}
}
uint32_t sys_hal_cpu_clk_div_get(uint32_t core_index)
{
	if(core_index == 0)
	{
		uint32_t reg_value;
    	reg_value = REG_READ(0x44010000+0x4*4);
    	reg_value = ((reg_value >> 4) & 0xf);
    	return reg_value;
	}
	else
	{
		//return sys_ll_get_cpu1_int_halt_clk_op_cpu0_bus_clk_2div();
		uint32_t reg_value;
    	reg_value = REG_READ(0x44010000+0x5*4);
    	reg_value = ((reg_value >> 4) & 0xf);
    	return reg_value;
	}
}
int32 sys_hal_lp_vol_set(uint32_t value)
{
	return 0;
}

uint32_t sys_hal_lp_vol_get()
{
	return 0;
}

int32 sys_hal_rf_tx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg8_t_vanaldosel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);
	return 0;
}
uint32_t sys_hal_rf_tx_vol_get()
{
	return sys_ll_get_ana_reg8_t_vanaldosel();
}
int32 sys_hal_rf_rx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg8_r_vanaldosel(value);
	sys_ll_set_ana_reg9_spi_latch1v(0);
	return 0;
}
uint32_t sys_hal_rf_rx_vol_get()
{
	return sys_ll_get_ana_reg8_r_vanaldosel();
}
int32 sys_hal_bandgap_cali_set(uint32_t value)//increase or decrease the dvdddig voltage
{
	return 0;
}
uint32_t sys_hal_bandgap_cali_get()
{
	return 0;
}
bk_err_t sys_hal_core_bus_clock_ctrl(uint32_t cksel_core, uint32_t ckdiv_core,uint32_t ckdiv_bus, uint32_t ckdiv_cpu0,uint32_t ckdiv_cpu1)
{
	uint32_t clk_param  = 0;
	uint32_t     h_vol  = 0;
	if(cksel_core > 3)
	{
		os_printf("set dvfs cksel core > 3 invalid %d\r\n",cksel_core);
		return BK_FAIL;
	}

	if((ckdiv_core > PM_FREQUNCY_DIV_MAX) || (ckdiv_bus > PM_FREQUNCY_DIV_BUS_MAX)||(ckdiv_cpu1 > PM_FREQUNCY_DIV_CPU1_MAX))
	{
		os_printf("set dvfs ckdiv_core ckdiv_bus ckdiv_cpu0  ckdiv_cpu0  > 15 invalid\r\n");
		return BK_FAIL;
	}
	if((cksel_core == PM_CLKSEL_CORE_320M)&&(ckdiv_core == PM_CLKDIV_CORE_0)&&(ckdiv_cpu1 != PM_CLKDV_CPU1_1))
	{
		os_printf("unsupport the cpu freq setting %d %d %d\r\n",cksel_core,ckdiv_core,ckdiv_cpu1);
		return BK_FAIL;
	}

	if((cksel_core == PM_CLKSEL_CORE_480M)&&(ckdiv_core == PM_CLKDIV_CORE_0))
	{
		os_printf("unsupport the cpu freq setting %d %d %d\r\n",cksel_core,ckdiv_core,ckdiv_cpu1);
		return BK_FAIL;
	}

	if((cksel_core == PM_CLKSEL_CORE_480M)&&(ckdiv_core == PM_CLKDIV_CORE_1)&&(ckdiv_cpu1 != PM_CLKDV_CPU1_1))
	{
		os_printf("unsupport the cpu freq setting %d %d %d\r\n",cksel_core,ckdiv_core,ckdiv_cpu1);
		return BK_FAIL;
	}

	if((cksel_core == PM_CLKSEL_CORE_320M)&&(ckdiv_core == PM_CLKDIV_CORE_0))
	{
		h_vol = sys_hal_vdddig_h_vol_get();
		if(h_vol < PM_VDDDIG_H_VOL_0v9)
		{
			sys_hal_ctrl_vdddig_h_vol(PM_VDDDIG_H_VOL_0v9);
		}
	}
	clk_param = 0;
	clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
	if(((clk_param >> 0x4)&0x3) > cksel_core)//when it from the higher frequency to lower frequency
	{
		/*1.core clk select*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config bus and core clk div*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~((0x1 << 6)|(0xF << 0));
		clk_param |=  ckdiv_core << 0;
		clk_param |=  (ckdiv_bus&0x1) << 6;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*3.config cpu clk div*/
		sys_hal_cpu_clk_div_set(1,ckdiv_cpu1);

	}
	else//when it from the lower frequency to higher frequency
	{
		/*1.config bus and core clk div*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 0);
		clk_param |=  ckdiv_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x1 << 6);
		clk_param |=  (ckdiv_bus&0x1) << 6;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config cpu clk div*/
		sys_hal_cpu_clk_div_set(1,ckdiv_cpu1);

		/*3.core clk select*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 4);
		clk_param |=  cksel_core << 4;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);
	}

	return BK_OK;
}

bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value)
{
	sys_ll_set_ana_reg9_spi_latch1v(1);
	sys_ll_set_ana_reg9_vcorehsel(vol_value);

	sys_ll_set_ana_reg9_spi_latch1v(0);

	return BK_OK;
}

uint32_t sys_hal_vdddig_h_vol_get()
{
	return sys_ll_get_ana_reg9_vcorehsel();
}

bk_err_t sys_hal_switch_cpu_bus_freq(pm_cpu_freq_e cpu_bus_freq)
{
    bk_err_t ret = BK_OK;
    switch(cpu_bus_freq)
    {
		case PM_CPU_FRQ_320M://cpu0:160m;cpu1:320m;bus:160m
			//sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			//ret = sys_hal_core_bus_clock_ctrl(0x2,0x0,0x0,0x0,0x1);
			sys_hal_ctrl_vdddig_h_vol(0x8);//0.8V     //When the voting frequency is greater than PM_CPU_FRQ_240M, set PM_CPU_FRQ_240M
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x0,0x1);
			break;
		case PM_CPU_FRQ_240M://cpu0:120m;cpu1:240m;bus:120m
		    sys_hal_ctrl_vdddig_h_vol(0xC);//0.8V
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x0,0x1);
			break;
		case PM_CPU_FRQ_120M://cpu0:120m;cpu1:120m;bus:120m
		    sys_hal_ctrl_vdddig_h_vol(0x8);//0.8V
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x3,0x0,0x0,0x0);
			break;
		case PM_CPU_FRQ_80M://cpu0:80m;cpu1:80m;bus:80m
		    sys_hal_ctrl_vdddig_h_vol(0x7);//0.775V
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x5,0x0,0x0,0x0);
			break;
		case PM_CPU_FRQ_60M://cpu0:60m;cpu1:60m;bus:60m
		    sys_hal_ctrl_vdddig_h_vol(0x6);//0.75V
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x7,0x0,0x0,0x0);
			break;
		case PM_CPU_FRQ_26M://cpu0:26m;cpu1:26m;bus:26m
		    sys_hal_ctrl_vdddig_h_vol(0x5);//0.725V
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x0,0x0);
			break;
		default:
			break;
    }

	return ret;
}

/*for low power function end*/
/*sleep feature end*/

uint32 sys_hal_get_chip_id(void)
{
	return sys_ll_get_version_id_versionid();
}

