bekencorp/bk_idk/middleware/soc/bk7258_cp1/hal/sys_hal.c
void sys_hal_dmic_clk_div_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_reserved_13_13(value);
}

void sys_hal_aud_dac_bypass_dwa_en(uint32_t value)
{
	sys_ll_set_ana_reg21_bpdwa0v9(value);
}

void sys_hal_aud_dac_dacmute_en(uint32_t value)
{
	sys_ll_set_ana_reg20_dacmute(value);
}

/**  Audio End  **/

/**  FFT Start  **/

void sys_hal_fft_disckg_set(uint32_t value)
{
	//sys_ll_set_cpu_mode_disckg1_fft_disckg(value);
}

void sys_hal_cpu_fft_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_fft_int_en(value);
}

/**  FFT End  **/

/**  I2S Start  **/
void sys_hal_i2s_select_clock(uint32_t value)
{
	//sys_ll_set_cpu_clk_div_mode1_cksel_i2s(value);
	sys_ll_set_cpu_clk_div_mode1_cksel_i2s(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s1(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s2(value);
}

void sys_hal_i2s_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s_cken(value);
}

void sys_hal_i2s1_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_i2s1_cken(value);
}

void sys_hal_i2s2_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_i2s2_cken(value);
}

void sys_hal_i2s_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s0_int_en(value);
}

void sys_hal_i2s1_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_i2s1_int_en(value);
}

void sys_hal_i2s2_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_i2s2_int_en(value);
}

void sys_hal_i2s_disckg_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_en(uint32_t value)
{
	if (value == 0)
		sys_ll_set_ana_reg5_pwdaudpll(1);
	else
		sys_ll_set_ana_reg5_pwdaudpll(0);
}

void sys_hal_cb_manu_val_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_ana_reg11_vsel_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_cal_val_set(uint32_t value)
{
	sys_ll_set_ana_reg26_value(value);
}

void sys_hal_apll_spi_trigger_set(uint32_t value)
{
	sys_ll_set_ana_reg25_spi_trigger(value);
}

void sys_hal_i2s0_ckdiv_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_config_set(uint32_t value)
{
	sys_ll_set_ana_reg25_value(value);
}

/**  I2S End  **/

/**  Touch Start **/
void sys_hal_touch_power_down(uint32_t value)
{
	sys_ll_set_ana_reg14_pwd_td(value);
}

void sys_hal_touch_sensitivity_level_set(uint32_t value)
{
	sys_ll_set_ana_reg14_gain_s(value);
}

void sys_hal_touch_scan_mode_enable(uint32_t value)
{
	//sys_ll_set_ana_reg8_en_scm(value);
}

void sys_hal_touch_detect_threshold_set(uint32_t value)
{
	sys_ll_set_ana_reg14_vrefs(value);
}

void sys_hal_touch_detect_range_set(uint32_t value)
{
	sys_ll_set_ana_reg14_crg(value);
}

void sys_hal_touch_calib_enable(uint32_t value)
{
	sys_ll_set_ana_reg15_en_cal_force1v(value);
}

void sys_hal_touch_manul_mode_calib_value_set(uint32_t value)
{
	//sys_ll_set_ana_reg8_cap_calspi(value);
}

void sys_hal_touch_manul_mode_enable(uint32_t value)
{
	//sys_ll_set_ana_reg9_man_mode(value);
}

void sys_hal_touch_scan_mode_chann_set(uint32_t value)
{
	sys_ll_set_ana_reg15_chs(value);
}

void sys_hal_touch_scan_mode_chann_sel(uint32_t value)
{
	sys_ll_set_ana_reg15_chs_sel_cal1v(value);
}

void sys_hal_touch_serial_cap_enable(void)
{
	sys_ll_set_ana_reg14_en_seri_cap(1);
}

void sys_hal_touch_serial_cap_disable(void)
{
	sys_ll_set_ana_reg14_en_seri_cap(0);
}

void sys_hal_touch_serial_cap_sel(uint32_t value)
{
	//sys_ll_set_ana_reg14_sel_seri_cap(value);
}

void sys_hal_touch_spi_lock(void)
{
	sys_ll_set_ana_reg14_td_latch1v(0);
}

void sys_hal_touch_spi_unlock(void)
{
	sys_ll_set_ana_reg14_td_latch1v(1);
}

void sys_hal_touch_test_period_set(uint32_t value)
{
	sys_ll_set_ana_reg15_test_period1v(value);
}

void sys_hal_touch_test_number_set(uint32_t value)
{
	sys_ll_set_ana_reg15_test_number1v(value);
}

void sys_hal_touch_calib_period_set(uint32_t value)
{
	sys_ll_set_ana_reg16_cal_period1v(value);
}

void sys_hal_touch_calib_number_set(uint32_t value)
{
	sys_ll_set_ana_reg16_cal_number1v(value);
}

void sys_hal_touch_int_set(uint32_t value)
{
	sys_ll_set_ana_reg16_int_en(value);
}

void sys_hal_touch_int_clear(uint32_t value)
{
	sys_ll_set_ana_reg17_int_clr(value);
}

void sys_hal_touch_int_enable(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_touched_int_en(value);
}

/**  Touch End **/


/** jpeg start **/
void sys_hal_set_jpeg_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_jpeg(value);
}

void sys_hal_set_clk_div_mode1_clkdiv_jpeg(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_jpeg(value);
}

void sys_hal_set_jpeg_disckg(uint32_t value)
{
	//sys_ll_set_cpu_mode_disckg1_jpeg_disckg(value);
}

void sys_hal_set_cpu_clk_div_mode1_clkdiv_bus(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_bus(value);
}

void sys_hal_video_power_en(uint32_t value)
{
	sys_ll_set_cpu_power_sleep_wakeup_pwd_vidp(value);
}

void sys_hal_set_auxs_cis_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_cksel_auxs_cis(value);
}

void sys_hal_set_auxs_cis_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_auxs_cis(value);
}

void sys_hal_set_jpeg_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_jpeg_cken(value);
}

void sys_hal_set_cis_auxs_clk_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_cis_auxs_cken(value);
}

/** jpeg end **/

/** h264 Start **/
void sys_hal_set_h264_clk_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_h264_cken(value);
}

/** h264 End **/

/**  psram Start **/
void sys_hal_psram_volstage_sel(uint32_t enable)
{
	sys_ll_set_ana_reg13_psldo_swb(enable); //1-1.8v, 0-3.0v
}

void sys_hal_psram_xtall_osc_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_xtall(enable);
}

void sys_hal_psram_doc_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_dco(enable);
}

void sys_hal_psram_ldo_enable(uint32_t enable)
{
	sys_ll_set_ana_reg13_enpsram(enable);
}

uint32_t sys_hal_psram_ldo_status()
{
	return sys_ll_get_ana_reg13_enpsram();
}

void sys_hal_psram_dpll_enable(uint32_t enable)
{
	sys_ll_set_ana_reg5_en_dpll(enable);
}

void sys_hal_psram_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_psram(value);
}

