bekencorp/bk_idk/middleware/soc/bk7258_cp1/hal/sys_hal.c
void sys_hal_psram_set_clkdiv(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_psram(value);
}

void sys_hal_psram_psldo_vsel(uint32_t value)
{
	sys_ll_set_ana_reg13_vpsramsel(value);// 1.8V + step 50mv
}

void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	// psldo_swb=1, vpsramsel=0 - 1.80v
	// psldo_swb=1, vpsramsel=1 - 1.85v
	// psldo_swb=1, vpsramsel=2 - 1.90v
	// psldo_swb=1, vpsramsel=3 - 1.95v
	// psldo_swb=0, vpsramsel=* - 3.00v
	sys_ll_set_ana_reg13_psldo_swb(output_voltage); //1-1.8v, 0-3.0v
	sys_ll_set_ana_reg13_vpsramsel(is_add_200mv);// 1.8V + step 50mv
}

void sys_hal_psram_psram_disckg(uint32_t value)
{
	// not support
}

/**  psram End **/

/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
    return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}

void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
    sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}

void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
	sys_ll_set_sys2flsh_2wire(value);
}

/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
    sys_ll_set_cpu0_int_32_63_en_cpu0_eth_int_en(value);
}
#endif
/** Ethernet End**/

/**  Misc Start **/
//Misc
/**  Misc End **/

void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
	//sys_ll_set_ana_reg5_trxt_tst_enable(value);
}


void sys_hal_set_ana_scal_en(uint32_t value)
{
	//sys_ll_set_ana_reg7_scal_en(value);
}


void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
   //sys_ll_set_ana_reg7_gadc_buf_ictrl(value);
}

void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
    //sys_ll_set_ana_reg7_gadc_cmp_ictrl(value);
}

void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
	//sys_ll_set_ana_reg6_pwd_gadc_buf(value);
}

void sys_hal_set_saradc_config(void)
{
	sys_ll_set_ana_reg2_sp_nt_ctrl(0x3);
	sys_ll_set_ana_reg2_gadc_capcal(0);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(1);
	sys_ll_set_ana_reg2_gadc_refbuf_ictrl(2);
	sys_ll_set_ana_reg2_gadc_inbuf_ictrl(2);
	sys_ll_set_ana_reg2_gadc_cmp_ictrl(2);
	// sys_ll_set_ana_reg2_xtalh_ctune(30);
}

void sys_hal_set_sdmadc_config(void)
{
	sys_ll_set_ana_reg2_sp_nt_ctrl(0x50);
	sys_ll_set_ana_reg2_gadc_capcal(0x4);
	sys_ll_set_ana_reg2_gadc_nobuf_enable(1);
	sys_ll_set_ana_reg2_gadc_refbuf_ictrl(0);
	sys_ll_set_ana_reg2_gadc_inbuf_ictrl(0);
	sys_ll_set_ana_reg2_gadc_cmp_ictrl(0);
	// sys_ll_set_ana_reg2_xtalh_ctune(0);
}

void sys_hal_set_ana_vref_sel(uint32_t value)
{
	//sys_ll_set_ana_reg7_vref_sel(value);
}
void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_en(value);
}

void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_start(value);
}
void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
    //sys_ll_set_ana_reg3_vlsel_ldodig(value);
}
void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
    //sys_ll_set_ana_reg3_vhsel_ldodig(value);
}

void sys_hal_set_sdio_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_sdio_cken(value);
}

void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_sdio_int_en(value);
}

void sys_hal_set_cpu1_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu1_int_0_31_en_cpu1_sdio_int_en(value);
}

void sys_hal_set_sdio_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_div()
{
	return sys_ll_get_cpu_clk_div_mode2_ckdiv_sdio();
}

void sys_hal_set_sdio_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_sel()
{
	return sys_ll_get_cpu_clk_div_mode2_cksel_sdio();
}


void sys_hal_set_ana_vctrl_sysldo(uint32_t value)
{
    //sys_ll_set_ana_reg5_vctrl_sysldo(value);
}

void sys_hal_set_yuv_buf_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_yuv_cken(value);
}

void sys_hal_set_h264_clock_en(uint32_t value)
{
	sys_ll_set_reserver_reg0xd_h264_cken(value);
}

void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_wdt(value);
}

uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return sys_ll_get_cpu_26m_wdt_clk_div_ckdiv_wdt();
}


void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
	sys_ll_set_ana_reg5_vbias(value);
}

void sys_hal_set_ana_reg11_apfms(uint32_t value) {
	sys_ll_set_ana_reg11_apfms(value);
}

void sys_hal_set_ana_reg12_dpfms(uint32_t value) {
	sys_ll_set_ana_reg12_dpfms(value);
}

void sys_hal_set_rott_int_en(uint32_t value)
{
	uint32_t int_level = rtos_disable_int();

#if CONFIG_SYS_CPU0
	sys_ll_set_cpu0_int_32_63_en_cpu0_rott_int_en(value);
#else
	sys_ll_set_cpu1_int_32_63_en_cpu1_rott_int_en(value);
#endif

	rtos_enable_int(int_level);
}

static void sys_hal_delay(volatile uint32_t times)
{
        while(times--);
}

uint32_t sys_hal_cali_dpll(uint32_t param)
{
    sys_hal_cali_dpll_spi_trig_disable();

    if (!param)
    {
        sys_hal_delay(120);
    }
    else
    {
        sys_hal_delay(60);
    }

    sys_hal_cali_dpll_spi_trig_enable();
    sys_hal_cali_dpll_spi_detect_disable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

    return BK_OK;
}

//TODO the module owner can put the sys init to better place
void sys_hal_early_init(void)
{
	uint32_t chip_id = aon_pmu_hal_get_chipid();

	uint32_t val = sys_hal_analog_get(ANALOG_REG5);
	val |= (0x1 << 5) | (0x1 << 3) | (0x1 << 2);
	sys_hal_analog_set(ANALOG_REG5,val);
	//donghui20230504: 0:1/7 1:1/5 2:1/3 3:1/1
	sys_ll_set_ana_reg5_adc_div(1); //tenglong20230627 adc_div=1/5 since volt of GPIO <= 3.3V

	val = sys_hal_analog_get(ANALOG_REG0);
	val |= (0x13 << 20) ;
	sys_hal_analog_set(ANALOG_REG0,val);

	sys_hal_analog_set(ANALOG_REG0, 0xF1305B56);  //zhangheng20231020 <0>=0 pdll test disalbe for safe
	sys_ll_set_ana_reg0_dsptrig(1);
	sys_ll_set_ana_reg0_dsptrig(0);

	sys_hal_analog_set(ANALOG_REG2, 0x7E003450); //wangjian20221110 xtal=0x50
	//sys_ll_set_cpu_device_clk_enable_value(0x0c008084);
	sys_hal_analog_set(ANALOG_REG3, 0xC5F00B88);

	/**
	 * attention:
	 * SPI latch must be enable before ana_reg[8~13] modification
	 * and don't forget disable it after that.
	 */
	sys_ll_set_ana_reg9_spi_latch1v(1);
	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG8, 0x57E62FFE);
	} else {
		sys_hal_analog_set(ANALOG_REG8, 0x57E62F26);//shuguang20230414[8:3]7->4: for evm
	}
	sys_hal_analog_set(ANALOG_REG9, 0x787BC34A); //tenglong20231017: revert <15> to 1 for softstart, should not change it
	sys_hal_analog_set(ANALOG_REG10, 0xC35543C7);//tenglong20230417:rosc config for buck in lowpower
	if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG11, 0x9FEF31F7);
		sys_hal_analog_set(ANALOG_REG12, 0x9F03EF6F);
		sys_hal_analog_set(ANALOG_REG13, 0x1F6FB3FF);
	} else if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V4 & PM_CHIP_ID_MASK)) {
		sys_hal_analog_set(ANALOG_REG11, 0x977EB9FF);
		sys_hal_analog_set(ANALOG_REG12, 0x977ECA4A);
		sys_hal_analog_set(ANALOG_REG13, 0x547AB0F5);
	} else {
		//default of MP
		//tenglong20231017: SYS_reg0x4B<3:0>=8,SYS_reg0x4C<3:0>=0,SYS_reg0x4D<4:1>=7 for softstart
		sys_hal_analog_set(ANALOG_REG11, 0x907EB878);
		sys_hal_analog_set(ANALOG_REG12, 0x907ECA40);
		sys_hal_analog_set(ANALOG_REG13, 0x727070EE);//tenglong20231020 disable psram/update volt for safe
		sys_hal_analog_set(ANALOG_REG25, 0x961FAA4);

		sys_ll_set_ana_reg3_inbufen0v9(1);
	}
	sys_ll_set_ana_reg9_spi_latch1v(0);

	//zhangheng20231018: calibrate dpll before use
	sys_hal_cali_dpll(0);

	if (((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V2_3 & PM_CHIP_ID_MASK))
	|| ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_MPW_V4 & PM_CHIP_ID_MASK))) {
		sys_hal_flash_set_clk(0x2);
	} else {
		//default of MP
		sys_hal_flash_set_clk(0x1);
	}

	/* clk_divd 120MHz,
	 * 1, the core clock is depended on CONFIG_CPU_FREQ_HZ and configSYSTICK_CLOCK_HZ.
	 *    Pay attention to bk_pm_module_vote_cpu_freq,and the routine will switch core
	 *    clock;
	 * 2, sysTick module's clock source is processor clock now;
	 */
	sys_hal_mclk_div_set(480000000/CONFIG_CPU_FREQ_HZ - 1);
	sys_hal_delay(10000);
	sys_hal_mclk_mux_set(0x3);/*clock source: DPLL, 480M*/

	timer_hal_us_init();
}
